# EDA - CUSTOMER SEGMENTATION DATASET

About the dataset:

Link: https://www.kaggle.com/datasets/muhammadhussnain09/customer-behaviour-dataset/data

Info: This dataset contains 350 customer records with a mix of numerical and categorical features. It includes demographics, spending behavior, and product preferences, making it suitable for unsupervised learning and customer segmentation tasks.

## Libraries and data

In [2]:
# Libraries

import pandas as pd

In [3]:
# Data

PATH_FILE = "/home/gustavo/repos/pandas_specialization/data/customer_segmentation_mixed.csv"
dataset = pd.read_csv(PATH_FILE)

## Inspecting dataset

In [5]:
dataset.head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
0,56,26102,85,6,Female,Clothing
1,46,70336,75,18,Male,Home
2,32,105314,36,10,Male,Groceries

In [6]:
dataset.tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
347,50,42700,77,19,Male,Clothing
348,38,54620,3,6,Female,Electronics
349,49,40559,33,2,Male,Clothing

In [8]:
dataset.info()

<class 'pandas.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                350 non-null    int64
 1   Annual_Income      350 non-null    int64
 2   Spending_Score     350 non-null    int64
 3   Monthly_Visits     350 non-null    int64
 4   Gender             350 non-null    str
 5   Preferred_Product  350 non-null    str
dtypes: int64(4), str(2)
memory usage: 16.5 KB